mwg.wb.webapi/soapxml/GetPriceBHXOnline.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthenSoapHeader xmlns="http://tempuri.org/">
      <GUID>string</GUID>
      <AuthenData>{AuthenData}</AuthenData>
      <DelegatingUser>string</DelegatingUser>
      <LanguageID>0</LanguageID>
      <ModuleID>0</ModuleID>
    </AuthenSoapHeader>
  </soap:Header>
  <soap:Body>
    <GetPriceBHXOnline xmlns="http://tempuri.org/">
      <productId>{productId}</productId>
      <intStoreId>{intStoreId}</intStoreId>
    </GetPriceBHXOnline>
  </soap:Body>
</soap:Envelope>